Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཞེས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་ཏེ། དེ་ལ་ཆོས་ཉིད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མི་འགྱུར་བ། སྒྲོ་མ་བཏགས་པ། མི་བྱེད་པ། རྣམ་པར་མི་བྱེད་པ། མི་གནས་པ། གནས་མེད་པ། རྩེ་བ་མེད་པ། ཐམས་ཅད་དུ་མཉམ་པ། མཉམ་པ་ལ་མཉམ་པ། མི་མཉམ་པ་ལ་མཉམ་པ། མཉམ་པ་དང་མི་མཉམ་པ་ལ་མཉམ་པ། རྣམ་པར་མི་རྟོག་པ། མི་རྩོམ་པ། ངེས་པར་གྱུར་པ། ཐོབ་པ། ཆོས་ཐམས་ཅད་ལ་ཤིན་ཏུ་ངོ་བོ་ཉིད་མེད་པའི་མཚན་ཉིད་དེ་ནི་ཆོས་ཉིད་ཅེས་བྱ་སྟེ
en: “What, then, is the Dharma itself? It is that which is unchanging; that which is not a fabrication; that which is not created; that which is not modified; that which does not remain; that which has no foundation; that which has no root; that which is complete sameness; that which is the same as sameness, the same as non-sameness, and the same as both sameness and non-sameness; that which is nonconceptual; that which is free from application; that which is definitive; that which is not attained; and that which is the complete absence of anything that could be characterized as an autonomous nature. This is what is known as the Dharma itself.

source: གང་དག་ཆོས་ཉིད་དེ་ལ་རྟོན་པར་བྱེད་པ་དེ་དག་ནི་ཁམས་གང་ལ་ཡང་རྟོན་པར་མི་བྱེད་དེ། དེ་བས་ན་ཆོས་ཀྱི་ཚུལ་གྱི་སྒོ་ལ་འཇུག་པ་འདིས་ཆོས་ཐམས་ཅད་ལ་རྟོན་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་དེ་ལྟ་བུའི་ཆོས་ཉིད་ཡིན་ནོ། ། དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྟོན་པ་བཞི་ཞེས་བྱ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྟོན་པ་ལ་མཁས་པའོ། ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྟོན་པ་ལ་མཁས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “Those who rely on the Dharma itself in this way, and who do not put their trust in the elements, have entered the door to the path of the Dharma. For them, all phenomena become just like the Dharma itself, and any phenomenon can then be used as a support. This is what is known as the four things bodhisatvas rely on, and the bodhisatva who is skilled in relying on these things practices the perfection of wisdom.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ལ་མཁས་པ་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚོགས་ནི་འདི་གཉིས་ཏེ། གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བསོད་ནམས་ཀྱི་ཚོགས་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་སོ། ། དེ་ལ་བསོད་ནམས་ཀྱི་ཚོགས་གང་ཞེ་ན། སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དང་། ཚུལ་ཁྲིམས་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དང་། སྒོམ་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དང་། བྱམས་པའི་སེམས་ལ་སྙོམས་པར་འཇུག་པ་དང་། སྙིང་རྗེའི་སྦྱོར་བ་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལ་རྩོམ་པ་དང་། བདག་དང་ཕ་རོལ་གྱི་སྡིག་པ་འཆགས་པ་དང་། དུས་གསུམ་དུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་དང་། སློབ་པ་ཐམས་ཅད་དང་། མི་སློབ་པ་ཐམས་ཅད་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། སེམས་དང་པོ་བསྐྱེད་པ་རྣམས་དང་། སྤྱོད་པ་ལ་ཞུགས་པ་རྣམས་དང་། ཕྱིར་མི་ལྡོག་པ་རྣམས་དང་། སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བསྐྱེད་པ་ལ་རྗེས་སུ་ཡི་རང་བ་དང་། འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་དགེ་བ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དང་། སངས་རྒྱས་ཐམས་ཅད་དང་། འཕགས་པ་ཐམས་ཅད་ལ་ཆོས་གསོལ་བ་འདེབས་པ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དང་།
en: “What is the bodhisatva’s skilled approach to accumulation? There are two things bodhisatvas accumulate. What are these two things? They are merit and knowledge. What is the accumulation of merit? It is the item of merit that is created through generosity, the item of merit that is created through morality, and the item of merit that is created through meditative cultivation. It is to remain in a mental state of love and to get involved out of compassion. It is to apply oneself to all the roots of virtue and to confession of one’s own evils and those of others. It is the item of merit that is created through rejoicing in all the roots of virtue of all sentient beings throughout the three times, of all those who are learning and who have no more to learn, of all pratyekabuddhas, of those who are newly committed, of those who are engaged in practice, of those whose progress is irreversible, and of those who have only one birth remaining, the item of merit that is created through rejoicing in those who have committed themselves, the lords, the buddhas, of the past, the future, and the present. It is the item of merit created through requesting the Dharma from all the buddhas and all the noble ones.

source: དགེ་བ་ཐམས་ཅད་བྱང་ཆུབ་ཏུ་བསྔོ་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དང་། སེམས་ཅན་བྱང་ཆུབ་ཏུ་སེམས་མ་བསྐྱེད་པ་རྣམས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་རྣམས་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་སྟོན་པ་དང་། དབུལ་པོ་རྣམས་ལ་ལོངས་སྤྱོད་ཀྱིས་སྡུད་པ་དང་། ནད་པ་རྣམས་ལ་སྨན་སྦྱིན་པ་དང་། གུས་པར་བསྙེན་བཀུར་བྱེད་པ་དང་། མཐུ་ཆུང་བ་རྣམས་ལ་བཟོད་ཅིང་དང་དུ་ལེན་པ་དང་། ལྟུང་བ་རྣམས་མི་འཆབ་པ་དང་། སྡིག་པ་འཆགས་པ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བཞུགས་པ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་རྣམས་ལ་བསྙེན་བཀུར་དང་། རི་མོ་ཐམས་ཅད་བྱེད་པ་དང་། སློབ་དཔོན་དང་མཁན་པོ་རྣམས་ལ་སྟོན་པ་བཞིན་དུ་རི་མོ་བྱེད་པ་དང་། ཆོས་ལ་རིན་པོ་ཆེ་རིན་ཐང་མེད་པ་བཞིན་དུ་ཡོངས་སུ་ཚོལ་བའི་བརྩོན་འགྲུས་དང་། ཆོས་སྨྲ་བ་ལ་དགའ་ཞིང་དཔག་ཚད་བརྒྱར་ཡང་སོང་སྟེ ཆོས་ཉན་པས་ཆོག་མི་ཤེས་པ་དང་། ཟང་ཟིང་མེད་པར་ཆོས་འཆད་པ་དང་། ཕ་དང་མ་ལ་རིམ་གྲོ་བྱེད་པ་དང་། བྱས་པ་གཟོ་བ་དང་། བྱས་པ་ཤེས་པ་དང་། འགྱོད་པ་མེད་པ་དང་། བསོད་ནམས་བསགས་པས་ཆོ་ག་མི་ཤེས་པ་དང་། ལུས་བསྡམས་ཤིང་ཚུལ་འཆོས་པ་མེད་པ་དང་། ངག་བསྡམས་པའི་ངག་ལ་ཚུལ་འཆོས་པ་མེད་པ་དང་། ཡིད་བསྡམས་པའི་ཡིད་ལ་ཚུལ་འཆོས་པ་མེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་བཙུགས་པའི་ཕྱིར་ཚངས་པའི་བསོད་ནམས་ཡོངས་སུ་འཛིན་པ་དང་། མཆོད་སྦྱིན་གཏན་པ་མེད་པ་བསགས་པས་མཚན་ཡོངས་སུ་རྫོགས་པ་དང་། དགེ་བའི་རྩ་བའི་ཚོགས་སྣ་ཚོགས་བསགས་པས་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་རྫོགས་པ་དང་། ང་རྒྱལ་མེད་པས་ལུས་བརྒྱན་པ་དང་། ངག་གི་ཉེས་པ་ཐམས་ཅད་སྤངས་པས་ངག་བརྒྱན་པ་དང་། བློ་ཐོགས་པ་མེད་པས་སེམས་བརྒྱན་པ་དང་། མངོན་པར་ཤེས་པ་སྤྲུལ་པས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྒྱན་དང་། ཡེ་ཤེས་ཡོངས་སུ་དག་པས་ཆོས་ཀྱི་མཚན་ཉིད་ཀྱི་རྒྱན་དང་། ཕྲ་མ་དང་། ཞེ་གཅོད་པ་དང་། དབྱེ་བའི་ཚིག་ཡོངས་སུ་སྤངས་པས་འཁོར་མང་པོའི་རྒྱན་དང་། ཆོས་འཛིན་པས་འདོད་ཆགས་མེད་པའི་ཆོས་ཀྱི་རྒྱན་དང་། རབ་ཏུ་དགའ་ནས་ལེགས་སོ། ། ཞེས་བྱ་བ་བྱིན་ནས་ ཆོས་ཀྱི་གཏམ་མི་འཇིགས་པར་བྱེད་པ་དང་། སྒྲིབ་པ་དང་། ཆོད་པ་རྣམ་པར་སྤངས་ཤིང་གུས་པར་ཆོས་ཉན་པས་འབྲས་བུ་ཡོད་པར་ཆོས་འཆད་པ་དང་། སངས་རྒྱས་རྣམས་ལ་དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་ཕུལ་བས་བྱང་ཆུབ་ཀྱི་ཤིང་གི་རྒྱན་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་སྔོན་དུ་འགྲོ་ཞིང་བྱང་ཆུབ་ཀྱི་སེམས་མི་གཏོང་བས་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་རྒྱན་དང་། ལས་དང་ཉོན་མོངས་པ་མི་དམིགས་པས་ཚེ་དང་ཤི་འཕོ་ཡོངས་སུ་དག་པ་དང་། རིན་པོ་ཆེ་ཕངས་པའི་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བས་ལག་ན་རིན་པོ་ཆེ་དང་། མི་ཟད་པའི་སྨོན་ལམ་ཐོབ་པས་ལོངས་སྤྱོད་མི་ཟད་པ་དང་།
en: It is the item of merit created through dedicating all one’s roots of virtue to awakening. It is to inspire the arising of the mind of awakening in all those in whom the mind of awakening has not yet arisen. It is to teach the path of the perfections to those in whom the mind of awakening has arisen, and to collect material wealth for the poor. It is to provide medicine for sick, to treat them with respect, and to accept those who are in a wretched state with no hesitation. It is to not conceal one’s failings and to confess what one has done wrong. It is to serve and revere, in many different ways, the lords, the buddhas, of the present who have reached final nirvāṇa. It is to respect the gurus and preceptors as spiritual friends. It is to search vigorously for the priceless, invaluable teachings. It is to show affection for those who preach the Dharma and to still thirst to listen to the Dharma even after one has traveled for a hundred yojanas. It is to teach the Dharma without any thought of material gain. It is to serve one’s parents. It is to show gratitude. It is to be grateful. It is to have no regrets and to not be satisfied with the merit one has accrued. It is to guard one’s physical conduct and not act in a hypocritical manner. It is to guard one’s speech and not speak in a hypocritical manner. It is to guard one’s mind and not think hypocritical thoughts. It is to establish monuments in honor of tathāgatas, which brings one as much merit as is possessed by Brahmā. It is to perform boundless acts of worship that lead one to attain the perfect characteristics and to gather the accumulations of various roots of virtue that lead one to attain the perfect characteristics. It is to ornament one’s body with the absence of conceit. It is to ornament one’s speech with the relinquishment of all wicked speech. It is to ornament the mind with an unimpeded intellect. It is to ornament the buddha realms with acts of transformation by using one’s superior abilities. It is to ornament the qualities of the Dharma with the purity of knowledge. It is to ornament assemblies with abstention from slander, harsh words, and divisive talk. It is to ornament the Dharma of nonattachment by upholding the Dharma. It is to contribute to the presentation of Dharma not being ruined by offering encouragement that brings delight. It is to provide effective teachings by removing obscurations and hindrances and by listening to the Dharma respectfully. It is to ornament the tree of awakening by offering groves and to ornament the seat of awakening by not relinquishing the mind of awakening, the mind that precedes all roots of virtue. It is to purify birth and death by not objectifying actions and the vices. It is to have a hand of wealth by giving away all one’s precious valuable objects and to make one’s wealth inexhaustible by increasing it through the inexhaustible act of dedicating.

source: ཁྲོ་གཉེར་མེད་པས་མཐོང་མ་ཐག་ཏུ་སེམས་ཅན་རྣམས་དད་ཅིང་བཞིན་འཛུམ་པས་གསོང་པོར་སྨྲ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་འོད་ཟེར་སྙོམས་པས་མཉམ་པ་ཉིད་ཀྱི་རྒྱན་ཐོབ་པ་དང་། མ་ལོབས་པ་ལ་མི་བརྙས་པས་འོད་མང་པོ་མཐོང་བ་དང་། ཚུལ་ཁྲིམས་ཀྱི་བསོད་ནམས་བསགས་པས་སྐྱེ་བ་ཡོངས་སུ་དག་པ་དང་། ལྟུང་བ་ལ་མི་རྩོད་པས་མངལ་ཡོངས་སུ་དག་པ་དང་། དགེ་བ་བཅུའི་ལས་ཡོངས་སུ་དག་པས་ལྷ་དང་མིར་སྐྱེ་བ་དང་། རྗེས་སུ་བསྟན་པ་ཐམས་ཅད་ལ་རབ་ཏུ་རྟོག་པས་གདོན་མི་ཟ་བར་ནོད་པ་དང་། ཆོས་ལ་སློབ་དཔོན་གྱི་དཔེ་མཁྱུད་མེད་པས་ཆོས་ཀྱི་དབང་ཕྱུག་དང་། ལྷག་པའི་བསམ་པ་ཡོངས་སུ་དག་པས་འཇིག་རྟེན་ཐམས་ཅད་ལ་མངོན་སུམ་པ་དང་། ཉི་ཚེ་བའི་སྤྱོད་པ་མི་འདོད་པས་རྒྱ་ཆེན་པོའི་ཆོས་ལ་དད་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་སེམས་མི་འདོར་བས་བསོད་ནམས་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པ་དང་། དད་པ་སྔོན་དུ་འགྲོ་བས་ནོར་བདུན་ཡོངས་སུ་རྫོགས་པ་དང་། སྔོན་དམ་བཅས་པ་ཉམས་སུ་ལོན་པར་བྱེད་པས་འཇིག་རྟེན་ཐམས་ཅད་མི་སླུ་བ་དང་། དགེ་བའི་ཆོས་ཡོངས་སུ་རྫོགས་པས་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་ཀྱི་ཚོགས་ལ་མཁས་པ་ཞེས་བྱའོ། །
en: “He displays no angry demeanor, and so he enjoys the open hearts, smiling faces, and pleasant conversation of all sentient beings. He radiates the same light on all sentient beings, and so he attains the adornment of sameness. He does not leave those who lack learning in darkness and emits an array of light. His morality and his merit prosper, and so his births become pure. He does not present arguments to try to excuse his failures, and so the womb is purified. He maintains the purity of the ten wholesome forms of conduct, and so he is reborn as a god or a human being. He observes all the guidelines, and so he attains unfaltering determination. He is not a teacher who holds back any teachings, and so he becomes a lord of the Dharma. His motivation is pure and excellent, and so the whole world becomes available to him. He does not settle for limited forms of conduct but places his confidence in the vastness of the Dharma. By not abandoning the mind of omniscience, he takes up all meritorious kinds of action. Impelled by faith, he perfects the seven kinds of riches. He honors his previous commitments, and so he does not deceive anyone in the world. He perfects the wholesome forms of conduct, and so he perfects all the teachings of the Buddha. This is what is known as the bodhisatva’s skilled approach to accumulation.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་ཚོགས་ལ་མཁས་པ་གང་ཞེ་ན། རྒྱུ་གང་གིས་ཡེ་ཤེས་སྐྱེ་བ་སྟེ། དེ་ལྟར་རྒྱུ་དང་རྐྱེན་གང་དང་གང་གིས་ཡེ་ཤེས་རྟོགས་པའོ། ། དེ་ལ་རྒྱུ་གང་རྐྱེན་གང་ཞེ་ན། ཆོས་ཚོལ་བ་ལ་རབ་ཏུ་འདུན་པ་དང་། ཡེ་ཤེས་ཀྱི་རྗེས་སུ་སོང་བའི་བཤེས་གཉེན་བསྟེན་པ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་རྟོན་གྱི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་མི་རྟོན་པ་དང་། དེ་དག་ལ་ང་རྒྱལ་མི་བྱེད་པ་དང་། བླ་མ་ལ་དགའ་བ་དང་། སྟོན་པ་ལ་དགའ་བ་དང་། དེའི་དགེ་བའི་བཤེས་གཉེན་དེ་དག་གིས་འདི་ནི་བསམ་པ་དང་ལྡན་པར་ཤེས་ནས་ཡེ་ཤེས་ཀྱི་གཏམ་གང་ཡང་མི་སྟོན་པ་མེད་པ་དང་། སྣོད་དུ་ཤེས་ནས་ བར་ཆད་མེད་པར་སེམས་རྩེ་གཅིག་ཏུ་ཆོས་སྟོན་པ་དང་། དེས་ཆོས་དེ་ཐོས་ནས་ ཆོས་ཀྱི་ཚོགས་ལ་བརྩོན་པར་བྱེད་དེ གང་ཆོས་ཀྱི་ཚོགས་ལ་བརྩོན་པར་བྱེད་པ་དེ་ཉིད་དེའི་ཡེ་ཤེས་ཀྱི་ཚོགས་ལ་བརྩོན་པ་ཡིན་ནོ། །
en: “What is the bodhisatva’s skilled approach to the accumulation of knowledge? Knowledge comes about on the basis of a particular cause, and there are different causes and conditions through which knowledge is attained. What are these causes? What are these conditions? They are to have a strong desire to search for the Dharma; to follow a friend who has attained knowledge; to rely on the knowledge of buddhas and not to rely on the knowledge of śrāvakas or pratyekabuddhas; to not to entertain any pride with respect to these things; and to have affection for one’s guru, to have affection for one’s teacher. “When his spiritual friends have concluded that he has the necessary motivation, they will not withhold any instructions in knowledge. When they see that he is a suitable vessel for it, they will not hesitate to teach him the Dharma attentively. When he learns the Dharma in this way, he applies himself to accumulating the Dharma, and someone who applies himself to accumulating the Dharma is someone who applies himself to accumulating knowledge.

source: དེ་ལ་ཆོས་ཀྱི་ཚོགས་ལ་བརྩོན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ་དོན་ཉུང་བ་དང་། བྱ་བ་ཉུང་བ་དང་། སྒྲ་ཉུང་བ་དང་། སྲོད་དང་ཐོ་རངས་ལ་མི་ཉལ་ཞིང་རྣལ་འབྱོར་ལ་བརྩོན་པ་དང་། འབྲེལ་བའི་དོན་ལ་ཡོངས་སུ་རྟོག་པ་དང་། ཕྱིར་ཞིང་ཡོངས་སུ་ཚོལ་བ་དང་། སེམས་ལ་རྙོག་པ་མེད་པ་དང་། སྒྲིབ་པ་གནོན་པ་དང་། ལྟུང་བ་ལས་འབྱུང་བར་ཤེས་པ་དང་། འགྱོད་པ་མེད་པ་དང་། ཀུན་ནས་ལྡང་བ་མེད་པ་དང་། ནན་ཏན་སྙིང་པོར་བྱེད་པ་དང་། ཆོས་ལ་གཞོལ་བ་དང་། ཆོས་ལ་འབབ་པ་དང་། ཆོས་ལ་བབ་པ་དང་། ཆོས་ལ་རྟུལ་བ་དང་། རྟག་པར་མགོ་དང་། གོས་ལ་མེ་འབར་བ་ལྟ་བུ་དང་། ཡེ་ཤེས་ཚོལ་བ་དེ་ཉིད་ལ་གནས་པ་དང་། མི་ལྷོད་པ་དང་། བརྩོན་འགྲུས་མི་གཏོང་བ་དང་། ཁྱད་པར་དུ་འགྲོ་བ་དང་། འདུ་འཛི་ལས་དབེན་པ་དང་། གཅིག་པུར་དགའ་བ་དང་། དགོན་པ་བདེ་བ་ཡིད་ལ་བྱེད་པ་དང་། འཕགས་པའི་རིགས་ལ་དགའ་བ་དང་། སྦྱངས་པ་ལས་མི་འགྱུར་བ་དང་། ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་ཞིང་མོས་པ་དང་། འཇིག་རྟེན་རྒྱང་ཕན་པའི་གསང་ཚིག་ལ་རི་མོར་མི་བྱེད་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཚོལ་བ་ལ་དྲན་པ་མི་ཉམས་པ་དང་། རྟོགས་པ་ལ་དོན་རྟོགས་པའི་རྗེས་སུ་འགྲོ་བ་དང་། བློ་གྲོས་ལ་ལམ་གྱི་རྗེས་སུ་འཐུན་པར་བྱེད་པ་དང་། མོས་པ་ལ་གདམས་པ་དང་། རྐྱེན་ལ་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་རིག་པ་དང་། ཁྲེལ་ཡོད་པ་དང་། ངོ་ཚ་ཤེས་པའི་རྒྱན་དང་། སངས་རྒྱས་ཀྱི་འགྲོས་ཀྱི་རྗེས་སུ་འགྲོ་བ་དང་། མི་ཤེས་པ་སེལ་བ་དང་། མ་རིག་པ་དང་། གཏི་མུག་གི་ལིང་ཏོག་སེལ་བ་དང་། ཤེས་རབ་ཀྱི་མིག་རྣམ་པར་དག་པ་དང་། རབ་ཏུ་རྣམ་པར་དག་པ་དང་། བློ་རྒྱ་ཆེན་པོ་དང་། བློ་མ་ཞུམ་པ་དང་། བློ་རབ་ཏུ་ཐ་དད་པ་དང་། མངོན་སུམ་དུ་ཤེས་པ་དང་། གཞན་ལ་རག་མ་ལུས་པའི་ཡོན་ཏན་དང་། རང་གི་ཡོན་ཏན་གྱིས་མི་སྙེམས་པ་དང་། ཕ་རོལ་གྱི་ཡོན་ཏན་ལ་རྟོག་པ་དང་། ལེགས་པར་བྱ་བའི་ལས་བྱེད་པ་དང་། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་མི་འགལ་བར་བྱེད་པ་དང་། ལས་ཡོངས་སུ་དག་པར་ཤེས་པ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡེ་ཤེས་ཀྱི་ཚོགས་ཞེས་བྱའོ། །
en: “What does it mean to apply oneself to accumulating the Dharma? It is to have few possessions, to have few tasks, and not to be overly talkative, to be of few words. It is to maintain the practice of staying awake late at night and rising early in the morning. It is to reflect on the meaning of what one has encountered, to search more and more deeply for it, and to keep one’s mind free from confusion. It is to cast off one’s obscurations, to know how to resolve one’s failures, to be without regret, to not be overwhelmed, and to maintain solid progress. It is to delve into the Dharma, to be open to the Dharma, to be inclined toward the Dharma, and to be diligent in the Dharma. It is to always act as if one’s clothes and hair were on fire. It is to search for knowledge and to remain in that very state. It is to not be lax and to not abandon one’s regular practice. It is to seek seclusion, to isolate oneself from society, to enjoy solitude, to reflect on the joys of retreat, and to delight in the noble family. It is to never stray from pure conduct, to find pleasure and satisfaction in the joyful Dharma, to not honor the sayings of the materialists, and to not lose one’s focus on the search for the transcendental Dharma. It is to have realization that is true to the meaning, to have a mind that remains loyal to the path, to keep firmly to one’s conviction, and to maintain an understanding of conditions. It is to ornament oneself with conscience and moral sensitivity, to be in harmony with the realization of the Buddha, to have rid oneself of ignorance, to have cleared away the veil of ignorance and delusion, and to have purified the eye of wisdom. It is to have a perfectly pure intellect, to have a broad intellect, to have an intellect that is not narrow, and to have an intellect that makes clear distinctions. It is to have the knowledge that sees directly, to have good qualities that are not dependent on others, to not be conceited about one’s own good qualities, and to recognize the good qualities of others. It is to perform good actions, to not obstruct the ripening of the fruits of one’s previous actions, and to understand the purification of actions. This is what is known as the accumulation of knowledge of the bodhisatva, the great being.

source: གཞན་ཡང་ཡེ་ཤེས་ཀྱི་ཚོགས་ནི་སྦྱིན་པ་བཞི་སྟེ། ཆོས་སྨྲ་བ་ལ་གྲོ་ག་དང་། སྨྱུ་གུ་དང་། སྣག་ཚ་དང་། གླེགས་བམ་སྦྱིན་པ་དང་། ཆོས་སྨྲ་བ་དང་། ཆོས་ཀྱི་སྟན་སྣ་ཚོགས་སྦྱིན་པ་དང་། ཆོས་སྨྲ་བ་ལ་རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ཐམས་ཅད་སྦྱིན་པ་དང་། ཆོས་སྨྲ་བ་ལ་ཆོས་ཀུན་བསྡུ་བའི་ཕྱིར་གཡོ་མེད་པར་ལེགས་སོ་ཞེས་བྱ་བ་སྦྱིན་པ་སྟེ། སྦྱིན་པ་བཞི་པོ་དེ་དག་ནི་ཡེ་ཤེས་ཀྱི་ཚོགས་སོགས་པར་འགྱུར་བའོ། །
en: “Furthermore, when it comes to the accumulation of knowledge, there are four kinds of generosity: providing teachers of the Dharma with birch bark, reed pencils, ink, and books; providing teachers of the Dharma with various kinds of seats for teaching the Dharma; providing teachers of the Dharma with all kinds of gain, honor, and praise; and providing teachers of the Dharma with unfeigned praise to encourage them in the Dharma. These are the four kinds of generosity that enable the accumulation of knowledge.

source: ཀུན་སྲུང་བ་བཞི་རྣམས་ཡེ་ཤེས་ཀྱི་ཚོགས་སོགས་པར་འགྱུར་ཏེ། ། བཞི་གང་ཞེ་ན། ཆོས་སྨྲ་བ་རྣམས་ཀྱི་ལུས་ཡོངས་སུ་སྲུང་བ་དང་། དགེ་བ་སྲུང་བ་དང་། ཡུལ་དང་ལྗོངས་སུ་འཇུག་པ་ལ་ཡོངས་སུ་སྲུང་བ་དང་། ཕན་པའི་དངོས་པོ་ཡོངས་སུ་སྲུང་བ་སྟེ། ཀུན་སྲུང་བ་ནི་བཞི་པོ་དེ་དག་གོ །
en: “There are four kinds of protection that enable the accumulation of knowledge. What are these four kinds of protection? They are protecting the bodies of the teachers of the Dharma, protecting their wholesome conduct, protecting them as they travel through different regions and countries, and protecting the things that aid them. These are the four kinds of protection.

source: ཉེ་བར་རྟོན་པ་བཞི་ཡེ་ཤེས་ཀྱི་ཚོགས་སུ་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། ཆོས་སྨྲ་བ་རྣམས་ཀྱི་ཆོས་ཉེ་བར་རྟོན་པ་དང་། ཡེ་ཤེས་ཉེ་བར་རྟོན་པ་དང་། ཟང་ཟིང་ཉེ་བར་རྟོན་པ་དང་། བྱང་ཆུབ་ཉེ་བར་རྟོན་པའོ། །
en: “There are four kinds of support that enable the accumulation of knowledge. What are these four kinds of support? They are supporting the teachers of the Dharma with the Dharma, supporting their knowledge, supporting them with material objects, and supporting their awakening.

source: སྟོབས་ལྔ་ཡེ་ཤེས་ཀྱི་ཚོགས་སུ་འགྱུར་ཏེ། ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མོས་པའི་ཕྱིར་དད་པའི་སྟོབས་དང་། ཐོས་པ་ཚོལ་བའི་ཕྱིར་བརྩོན་འགྲུས་ཀྱི་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗེད་པའི་ཕྱིར་དྲན་པའི་སྟོབས་དང་། མཉམ་པ་ཉིད་ཀྱི་ཆོས་ལ་ངེས་པར་རྟོགས་པའི་ཕྱིར་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་དང་། ཐོས་པའི་སྟོབས་ཀྱི་ཕྱིར་ཤེས་རབ་ཀྱི་སྟོབས་ཏེ། སྟོབས་ལྔ་པོ་དེ་དག་ཡེ་ཤེས་ཀྱི་ཚོགས་སུ་འགྱུར་རོ། །
en: “There are five powers that enable the accumulation of knowledge. What are these five powers? They are the power of faith that comes from conviction, the power of vigor that comes from one’s search for learning, the power of mindfulness that comes from one’s recollection of the mind of awakening, the power of concentration that comes from one’s contemplation of the Dharma of sameness, and the power of wisdom that comes from the power of learning. These are the five powers that enable the accumulation of knowledge.

source: ཚུལ་ཁྲིམས་བཞི་ཡེ་ཤེས་ཀྱི་ཚོགས་སོགས་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་ལ་ངེས་པའི་ཚུལ་ཁྲིམས་དང་། ཆོས་ཚོལ་བའི་ཚུལ་ཁྲིམས་དང་། ཆོས་ལ་ངེས་པར་རྟོག་པའི་ཚུལ་ཁྲིམས་དང་། བྱང་ཆུབ་ཏུ་བསྔོ་བའི་ཚུལ་ཁྲིམས་ཏེ། ཚུལ་ཁྲིམས་བཞི་པོ་དེ་དག་ཡེ་ཤེས་ཀྱི་ཚོགས་སོགས་པར་འགྱུར་རོ། །
en: “There are four kinds of discipline that enable the accumulation of knowledge. What are these four kinds of discipline? They are the discipline of honoring the Dharma, the discipline of seeking the Dharma, the discipline of reflecting on the Dharma, and the discipline of dedicating oneself to awakening. These are the four kinds of discipline that enable the accumulation of knowledge.

source: བཟོད་པ་བཞི་ཡེ་ཤེས་ཀྱི་ཚོགས་སོགས་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་ཚོལ་བ་ལ་མངོན་པར་བརྩོན་པས་ངན་དུ་སྨྲ་བ་དང་། ངན་དུ་བརྗོད་པའི་ཚིག་རྣམས་བཟོད་པ་དང་། ཆོས་ཚོལ་བ་ལ་མངོན་པར་བརྩོན་པས་རླུང་དང་། ཚ་བ་དང་། གྲང་བ་དང་། དྲོ་བ་དང་། སྐོམ་པ་དང་། བཀྲེས་པ་བཟོད་པ་དང་། ཆོས་ཚོལ་བ་ལ་མངོན་པར་བརྩོན་པས་སློབ་དཔོན་དང་། མཁན་པོའི་རྗེས་སུ་འཇུག་པ་དང་། ཆོས་ཚོལ་བ་ལ་མངོན་པར་བརྩོན་པས་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཆོས་བཟོད་པ་སྟེ། བཟོད་པ་བཞི་པོ་དེ་དག་ཡེ་ཤེས་ཀྱི་ཚོགས་སོགས་པར་འགྱུར་རོ། །
en: “There are four kinds of patient acceptance that enable the accumulation of knowledge. What are these four kinds of patient acceptance? They are to patiently endure verbal abuse and unpleasant remarks in one’s eager pursuit of the Dharma, to patiently endure wind, sun, cold, heat, hunger, and thirst in one’s eager pursuit of the Dharma, to obey one’s teachers and preceptors in one’s eager pursuit of the Dharma, and to accept the teachings on emptiness, freedom from attributes, and freedom from aspirations in one’s eager pursuit of the Dharma. These are the four kinds of patient acceptance that enable the accumulation of knowledge.

source: བརྩོན་འགྲུས་བཞི་ཡེ་ཤེས་ཀྱི་ཚོགས་སོགས་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཐོས་པའི་བརྩོན་འགྲུས་དང་། གཟུངས་ཀྱི་བརྩོན་འགྲུས་དང་། བརྟན་པའི་བརྩོན་འགྲུས་དང་། ནན་ཏན་གྱི་བརྩོན་འགྲུས་ཏེ། བརྩོན་འགྲུས་བཞི་པོ་དེ་དག་ཡེ་ཤེས་ཀྱི་ཚོགས་སོགས་པར་འགྱུར་རོ། །
en: “There are four kinds of vigor that enable the accumulation of knowledge. What are these four kinds of vigor? They are vigor in learning, vigor in remembering, vigor in teaching, and vigor in making progress. These are the four kinds of vigor that enable the accumulation of knowledge.

source: བསམ་གཏན་གྱི་ཡན་ལག་བཞི་ཡེ་ཤེས་ཀྱི་ཚོགས་སོགས་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དབེན་པ་དང་། གཅིག་པུར་དགའ་བ་དང་། ཡེ་ཤེས་དང་། མངོན་པར་ཤེས་པ་ཚོལ་བ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་འཇུག་པ་སྟེ། བསམ་གཏན་གྱི་ཡན་ལག་བཞི་པོ་དེ་དག་ཡེ་ཤེས་ཀྱི་ཚོགས་སོགས་པར་འགྱུར་རོ། །
en: “There are four aspects of meditation that enable the accumulation of knowledge. What are these four aspects of meditation? They are dwelling in seclusion, delighting in solitude, pursuing knowledge and the superior abilities, and engaging with the knowledge of the Buddha. These are the four aspects of meditation that enable the accumulation of knowledge.

source: ཤེས་རབ་སྣང་བའི་ཆོས་འདི་བཞི་ཡེ་ཤེས་ཀྱི་ཚོགས་སོགས་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཆད་པ་ལ་མི་གནས་པ་དང་། རྟག་པ་ལ་མི་འཇུག་པ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་། མི་འགལ་བ་དང་། བདག་མེད་པ་ལས་མོས་པ་སྟེ། ཤེས་རབ་སྣང་བའི་ཆོས་བཞི་པོ་དེ་དག་ཡེ་ཤེས་ཀྱི་ཚོགས་སོགས་པར་འགྱུར་རོ། །
en: “There are four manifestations of wisdom that enable the accumulation of knowledge. What are these four manifestations of wisdom? They are not ending up in annihilation, not insisting on permanence, not refuting dependent origination, and being favorably disposed to the lack of self. These are the four manifestations of wisdom that enable the accumulation of knowledge.
